--
-- Insert to ukraine.higher_education_institution
-- 
INSERT INTO ukraine.higher_education_institution (name, region, city, address)
VALUES ('Университет экономики и права "КРОК"', 'Киевский',
        'Киев', 'ул. Лагерная, 30-32  (карта)'),
       ('Международный научно-технический университет имени академика Юрия Бугая (МНТУ)',
        'Киевский', 'Киев', 'переулок Магнитогорский, 3'),
       ('Межрегиональная академия управления персоналом (МАУП)', 'Киевский', 'Киев', 'ул. Фрометовская, 2'),
       ('Школа Чародейства и Волшебства Хогвартс', 'Великобритания', 'Шотландия', 'Замок Хогвартс');



--
-- Insert to ukraine.education_form
--
INSERT INTO ukraine.education_form (type)
VALUES ('дневная'),
       ('заочная'),
       ('вечерняя'),
       ('дистанционная');


--
-- Insert to ukraine.speciality
--
INSERT INTO ukraine.speciality (code, name)
VALUES (141, 'Електроенергетика, електротехніка та електромеханіка'),
       (142, 'Енергетичне машинобудування'),
       (143, 'Атомна енергетика'),
       (144, 'Теплоенергетика');


--
-- Insert to ukraine.
--

INSERT INTO ukraine.competition (higher_education_institution_id, speciality_id, education_form_id, year,
                                 number_of_budget_places, number_of_commercial_places, price)
VALUES (2, 4, 4, '2029-01-01', 81, 18, 8610.04),
       (1, 1, 1, '2014-01-01', 11, 62, 25936.15),
       (1, 3, 4, '2005-01-01', 37, 6, 16175.28),
       (3, 1, 3, '2027-01-01', 47, 87, 16362.05),
       (3, 4, 2, '2018-01-01', 87, 31, 58638.29),
       (1, 2, 4, '2015-01-01', 26, 13, 34760.49),
       (4, 3, 1, '2019-01-01', 53, 57, 21341.17),
       (2, 4, 1, '2025-01-01', 88, 38, 18283.33),
       (4, 4, 3, '2015-01-01', 56, 66, 28559.64),
       (2, 3, 4, '2026-01-01', 63, 76, 55984.27),
       (3, 4, 3, '2007-01-01', 63, 96, 35347.08),
       (4, 2, 2, '2013-01-01', 41, 59, 44663.13),
       (4, 1, 4, '2012-01-01', 43, 5, 27567.76),
       (2, 4, 3, '2010-01-01', 85, 90, 32382.75),
       (3, 2, 4, '2002-01-01', 84, 97, 37440.88),
       (3, 3, 2, '2009-01-01', 66, 70, 18610.66),
       (1, 4, 2, '2020-01-01', 87, 49, 46423.87),
       (3, 1, 4, '2024-01-01', 47, 12, 9940.98),
       (1, 4, 1, '2026-01-01', 51, 76, 27646.95),
       (4, 1, 1, '2005-01-01', 83, 1, 26628.80),
       (3, 3, 4, '2021-01-01', 78, 54, 10485.13),
       (4, 1, 3, '2000-01-01', 35, 40, 42629.63),
       (2, 1, 4, '2020-01-01', 83, 70, 18914.99),
       (4, 3, 2, '2002-01-01', 29, 20, 50536.05),
       (1, 4, 3, '2020-01-01', 56, 29, 10066.47),
       (4, 2, 3, '2020-01-01', 99, 62, 6184.36),
       (1, 1, 4, '2023-01-01', 88, 18, 9536.38),
       (4, 4, 2, '2012-01-01', 75, 81, 27023.78),
       (3, 2, 2, '2010-01-01', 20, 79, 51612.51),
       (2, 2, 1, '2020-01-01', 39, 37, 5815.51),
       (2, 1, 2, '2029-01-01', 15, 19, 23263.08),
       (1, 3, 1, '2000-01-01', 84, 73, 22025.16),
       (3, 2, 3, '2016-01-01', 38, 72, 5834.97),
       (1, 2, 3, '2008-01-01', 52, 20, 11839.99),
       (4, 2, 4, '2005-01-01', 82, 79, 10510.97),
       (2, 4, 2, '2015-01-01', 11, 43, 50215.11),
       (3, 4, 4, '2008-01-01', 8, 28, 7958.21),
       (4, 3, 4, '2028-01-01', 16, 26, 55036.87),
       (2, 3, 2, '2028-01-01', 87, 30, 34468.50),
       (4, 2, 1, '2000-01-01', 81, 5, 55900.74),
       (2, 3, 1, '2015-01-01', 80, 34, 20065.85),
       (2, 1, 1, '2021-01-01', 65, 58, 49747.49),
       (3, 4, 1, '2008-01-01', 13, 31, 7365.02),
       (1, 2, 2, '2018-01-01', 56, 65, 24928.23),
       (2, 3, 3, '2009-01-01', 24, 20, 41162.80);